# House Price

 ### Predict house price using machine learning
 
 #### Hey there! This is a project that you can prdict appartment price,for example you say some options like number of room or area or address , ... and computer say you what is the appartment price.

### Impot Libraries

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

### Read Data

In [2]:
csv_file = pd.read_csv("csv/House_price.csv")

In [3]:
csv_file.describe()

              Room         Price    Price(USD)
count  3479.000000  3.479000e+03  3.479000e+03
mean      2.079908  5.359023e+09  1.786341e+05
std       0.758275  8.099935e+09  2.699978e+05
min       0.000000  3.600000e+06  1.200000e+02
25%       2.000000  1.418250e+09  4.727500e+04
50%       2.000000  2.900000e+09  9.666667e+04
75%       2.000000  6.000000e+09  2.000000e+05
max       5.000000  9.240000e+10  3.080000e+06

### Clean Data

#### in this data,some fields are null,for example some houses doesn't have address or they have a unblievble area,so let's clean data!

In [4]:
# Clean Area Column
area = np.asanyarray(csv_file["Area"])
b = []
for (i,a) in enumerate(area):
    if("," in a):
        b.append(i)

# update dataframe
data = csv_file.drop(b)

In [13]:
# Clean Address Column
address = np.asanyarray(data["Address"],dtype=str)
b = (address=='nan')
bb = np.asanyarray(data[b].index.tolist(),dtype=int)

# update dataframe
data = data.drop(bb)

In [15]:
data.head(10)

,Area,Room,Parking,Warehouse,Elevator,Address,Price,Price(USD)
0,63,1,True,True,True,Shahran,1.850000e+09,61666.67
1,60,1,True,True,True,Shahran,1.850000e+09,61666.67
2,79,2,True,True,True,Pardis,5.500000e+08,18333.33
3,95,2,True,True,True,Shahrake Qods,9.025000e+08,30083.33
4,123,2,True,True,True,Shahrake Gharb,7.000000e+09,233333.33
5,70,2,True,True,False,North Program Organization,2.050000e+09,68333.33
6,87,2,True,True,True,Pardis,6.000000e+08,20000.00
7,59,1,True,True,True,Shahran,2.150000e+09,71666.67
8,54,2,True,True,False,Andisheh,4.930000e+08,16433.33
9,71,1,True,True,True,West Ferdows Boulevard,2.370000e+09,79000.00

### Separation Data

In [18]:
data_ = data[data["Address"] == "Andisheh"]

x_data = np.asanyarray(data_[["Area","Room","Warehouse","Elevator"]],dtype=float)
y_data = np.asanyarray(data_["Price"],dtype=float)

In [19]:
# split data
msk = np.random.rand(len(data_)) > 0.8

x_train = x_data[~msk]
y_train = y_data[~msk]

x_test = x_data[msk]
y_test = y_data[msk]

### Create Model

In [20]:
from sklearn import linear_model

reg = linear_model.LinearRegression()

reg.fit(x_train,y_train)

print ('Coefficients: ', reg.coef_)

Coefficients:  [ 2.61482936e+07  9.45387645e+07  3.86328733e+08 -1.72865772e+08]

### Evaluvate

In [21]:
y_test_ = reg.predict(x_test)
print(f"R2 : {round(reg.score(x_test,y_test),2)}")

R2 : 0.91